src/cf/src/Catalogs/ТелеграмКлавиатуры/ТелеграмКлавиатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТелеграмКлавиатуры</name>
  <attributes>
    <name>ВидКлавиатуры</name>
    <type>
      <types>EnumRef.ТелеграмВидыКлавиатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Авторазмер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьПослеИспользования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКлавиатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Кнопки</name>
    <attributes>
      <name>Строка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеОтправки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>URL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапроситьКонтакт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапроситьМестоположение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Enums/ТелеграмВидыКлавиатуры/ТелеграмВидыКлавиатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТелеграмВидыКлавиатуры</name>
  <enumValues>
    <name>Стандартная</name>
  </enumValues>
  <enumValues>
    <name>Контекстная</name>
  </enumValues>
  <enumValues>
    <name>Программная</name>
  </enumValues>
  <enumValues>
    <name>СкрытьКлавиатуру</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/ТелеграмКлавиатуры/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоГруппа Тогда
		Возврат;	
	КонецЕсли;
	
	ВидыКлавиатуры = Перечисления.ТелеграмВидыКлавиатуры;
	Если ВидКлавиатуры = ВидыКлавиатуры.Контекстная Тогда
		
		Для Каждого СтрокаКнопка Из Кнопки Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаКнопка.ДанныеОтправки) 
				И Не ЗначениеЗаполнено(СтрокаКнопка.URL) Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1 табличной части ""Кнопки"" не заполнены ни данные отправки, ни URL.'"), СтрокаКнопка.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Отказ = Истина;
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаКнопка.ДанныеОтправки) 
				И ЗначениеЗаполнено(СтрокаКнопка.URL) Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'В строке %1 табличной части ""Кнопки"" заполнены и данные отправки, и URL (нужно что-то одно).'"), СтрокаКнопка.НомерСтроки);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				
				Отказ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
